In [11]:
import pandas as pd

In [12]:
df = pd.DataFrame({'A':[1,2,3], 'B': [4,5,6], 'C':[7,8,9]})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [13]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
# ghi de
# ap dung ca index va column
# df.index = ['V', 3, 4.3]
# df.columns = ['ABCX', 4, 55.54]
# df

In [15]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [16]:
# xem thong tin df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
A    3 non-null int64
B    3 non-null int64
C    3 non-null int64
dtypes: int64(3)
memory usage: 152.0 bytes

In [17]:
df.head(2)

   A  B  C
0  1  4  7
1  2  5  8

In [18]:
df.shape

(3, 3)

In [19]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

In [20]:
# lay cot cu the
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

In [21]:
a = ['A', 'B']
df[a]

   A  B
0  1  4
1  2  5
2  3  6

In [22]:
# lay thong tin cot thoa man
df[df.A == 1]

   A  B  C
0  1  4  7

In [23]:
df.A

0    1
1    2
2    3
Name: A, dtype: int64

In [24]:
# sapxep
df.sort_values('A', ascending=False)

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

In [25]:
# concat
df2 = pd.DataFrame([[10,11,12]])
df2.columns = ['A', 'B', 'C']
df3 = pd.concat([df, df2], axis=0)
df3

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  10  11  12

In [26]:
df2 = pd.DataFrame([[10], [12], [13]])
df2.columns = ['D']
df3 = pd.concat([df, df2], axis=1)
df3

   A  B  C   D
0  1  4  7  10
1  2  5  8  12
2  3  6  9  13

In [39]:
demo_df = pd.read_csv('demo.csv')
# demo_df = pd.read_csv('demo.csv', header=None) #no header
# demo_df = pd.read_csv('demo.csv', names=['A', 'B', 'C', 'D']) #modify columns
# demo_df = pd.read_csv('demo.csv', index_col='Price') # dung cot lam index
demo_df.head(10)

   Position  Large  No. Bedrooms   Price
0     Hanoi   20.0           2.0  1000.0
1     Hanam   50.0           4.0  2000.0
2   Namdinh   30.0           3.0  1500.0
3     Sonla   80.0           5.0  2500.0
4  Haiphong   15.0           1.0   200.0
5    Nghean   45.0           5.0  1600.0
6   Bacninh   10.0           1.0     NaN
7  Thanhhoa   35.0           NaN  2500.0
8    Cantho    NaN           NaN     NaN
9  Quangtri   20.0           1.0  1000.0

In [40]:
# kiem tra du lieu
demo_df.isnull()
demo_df.dropna()

   Position  Large  No. Bedrooms   Price
0     Hanoi   20.0           2.0  1000.0
1     Hanam   50.0           4.0  2000.0
2   Namdinh   30.0           3.0  1500.0
3     Sonla   80.0           5.0  2500.0
4  Haiphong   15.0           1.0   200.0
5    Nghean   45.0           5.0  1600.0
9  Quangtri   20.0           1.0  1000.0

In [41]:
demo_df.drop_duplicates()

   Position  Large  No. Bedrooms   Price
0     Hanoi   20.0           2.0  1000.0
1     Hanam   50.0           4.0  2000.0
2   Namdinh   30.0           3.0  1500.0
3     Sonla   80.0           5.0  2500.0
4  Haiphong   15.0           1.0   200.0
5    Nghean   45.0           5.0  1600.0
6   Bacninh   10.0           1.0     NaN
7  Thanhhoa   35.0           NaN  2500.0
8    Cantho    NaN           NaN     NaN
9  Quangtri   20.0           1.0  1000.0

In [46]:
demo_df['No. Bedrooms'].drop_duplicates()

0    2.0
1    4.0
2    3.0
3    5.0
4    1.0
7    NaN
Name: No. Bedrooms, dtype: float64

In [55]:
demo_df['No. Bedrooms'].unique()

array([ 2.,  4.,  3.,  5.,  1., nan])

In [56]:
demo_df['Price'] = demo_df['Price'].apply(lambda x: x**2)

In [57]:
demo_df

   Position  Large  No. Bedrooms      Price
0     Hanoi   20.0           2.0  1000000.0
1     Hanam   50.0           4.0  4000000.0
2   Namdinh   30.0           3.0  2250000.0
3     Sonla   80.0           5.0  6250000.0
4  Haiphong   15.0           1.0    40000.0
5    Nghean   45.0           5.0  2560000.0
6   Bacninh   10.0           1.0        NaN
7  Thanhhoa   35.0           NaN  6250000.0
8    Cantho    NaN           NaN        NaN
9  Quangtri   20.0           1.0  1000000.0

In [58]:
def square(x):
    return x**2
demo_df.LargeNew = demo_df.Large.apply(square)

/usr/lib/python3/dist-packages/ipykernel_launcher.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  This is separate from the ipykernel package so we can avoid doing imports until